# WireConduitTypes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..WireConduitTypes Property
ElectricalSetting Class See Also
---
Get electrical conduit types information of the project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireConduitTypeSet WireConduitTypes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WireConduitTypes As WireConduitTypeSet
	Get
```

Visual C++
---
```text
public:
property WireConduitTypeSet^ WireConduitTypes {
	WireConduitTypeSet^ get ();
}
```

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace